Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Create the HTTP endpoint
ja_jp: HTTPエンドポイントの作成

source: Create the JAX-RS resource
ja_jp: JAX-RSリソースの作成

source: Create the Jakarta REST resource
ja_jp: Jakarta RESTリソースの作成

source: Create the Maven Project
ja_jp: Mavenプロジェクトの作成

source: Create the Maven project
ja_jp: Maven プロジェクトの作成

source: Create the Quarkus AWS Lambda Maven project using our Maven Archetype.
ja_jp: Maven Archetype を使用して Quarkus AWS Lambda Maven プロジェクトを作成します。

source: Create the Quarkus AWS Lambda maven project using our Maven Archetype.
ja_jp: Maven Archetypeを使用してQuarkus AWS Lambda mavenプロジェクトを作成します。

source: Create the `CountResource` class as follows:
ja_jp: 以下のように `CountResource` クラスを作成します:

source: Create the `CountResource` class with the following content:
ja_jp: `CountResource` クラスを作成して、内容を更新します。

source: Create the `WebClient`. Be sure to use the `io.vertx.mutiny.ext.web.client.WebClient` class
ja_jp: `WebClient` を作成します。必ず `io.vertx.mutiny.ext.web.client.WebClient` クラスを使用してください。

source: Create the `org.acme.JsonToObjectConverter` class with the following content:
ja_jp: 以下の内容の `org.acme.JsonToObjectConverter` クラスを作成します:

source: Create the `org.acme.config.GreetingResource` REST resource with the following content:
ja_jp: `org.acme.config.GreetingResource` REST リソースを以下の内容で作成します:

source: Create the `org.acme.hibernate.search.elasticsearch.LibraryResource` class:
ja_jp: `org.acme.hibernate.search.elasticsearch.LibraryResource` クラスを作成します:

source: Create the `org.acme.microprofile.health.SimpleHealthCheck` class:
ja_jp: `org.acme.microprofile.health.SimpleHealthCheck` クラスを作成します:

source: Create the `org.acme.quartz.TaskResource` class with the following content:
ja_jp: `org.acme.quartz.TaskResource` クラスを以下の内容で作成します:

source: Create the `producer/src/main/java/org/acme/kafka/streams/producer/generator/ValuesGenerator.java` file, with the following content:
ja_jp: 以下の内容の `producer/src/main/java/org/acme/kafka/streams/producer/generator/ValuesGenerator.java` ファイルを作成します。

source: Create the `runtime/src/main/codestarts/quarkus/aloha-codestart` directory
ja_jp: `runtime/src/main/codestarts/quarkus/aloha-codestart` ディレクトリーを作成します

source: Create the `src/main/java/org/acme/HelloService.java` file with the following content:
ja_jp: 以下の内容の `src/main/java/org/acme/HelloService.java` ファイルを作成します。

source: Create the `src/main/java/org/acme/VertxResource.java` file. It will contain our HTTP endpoints.
ja_jp: `src/main/java/org/acme/VertxResource.java` ファイルを作成します。このファイルには、HTTPエンドポイントが含まれます。

source: Create the `src/main/java/org/acme/WeatherService.java` class with the following content:
ja_jp: 以下の内容で `src/main/java/org/acme/WeatherService.java` クラスを作成します：

source: Create the `src/main/java/org/acme/hibernate/orm/panache/FruitResource.java` file with the following content:
ja_jp: `src/main/java/org/acme/hibernate/orm/panache/FruitResource.java` ファイルを以下の内容で作成します。

source: Create the `src/main/java/org/acme/infinispan/client/InfinispanGreetingResource.java` file, with the following content:
ja_jp: 以下の内容で、 `src/main/java/org/acme/infinispan/client/InfinispanGreetingResource.java` ファイルを作成します:

source: Create the `src/main/java/org/acme/jms/PriceProducer.java` file, with the following content:
ja_jp: 以下の内容の `src/main/java/org/acme/jms/PriceProducer.java` ファイルを作成します:

source: Create the `src/main/java/org/acme/opentracing/TracedResource.java` file with the following content:
ja_jp: 以下の内容で `src/main/java/org/acme/opentracing/TracedResource.java` ファイルを作成します:

source: Create the `src/main/java/org/acme/optaplanner/domain/Lesson.java` class:
ja_jp: `src/main/java/org/acme/optaplanner/domain/Lesson.java` クラスを作成します。

source: Create the `src/main/java/org/acme/optaplanner/domain/Room.java` class:
ja_jp: `src/main/java/org/acme/optaplanner/domain/Room.java` クラスを作成します。

source: Create the `src/main/java/org/acme/optaplanner/domain/TimeTable.java` class:
ja_jp: `src/main/java/org/acme/optaplanner/domain/TimeTable.java` クラスを作成します。

source: Create the `src/main/java/org/acme/optaplanner/domain/Timeslot.java` class:
ja_jp: `src/main/java/org/acme/optaplanner/domain/Timeslot.java` クラスを作成します。

source: Create the `src/main/java/org/acme/optaplanner/rest/TimeTableResource.java` class:
ja_jp: `src/main/java/org/acme/optaplanner/rest/TimeTableResource.java` クラスを作成します。

source: Create the `src/main/java/org/acme/redis/IncrementResource.java` file, with the following content:
ja_jp: 以下の内容の `src/main/java/org/acme/redis/IncrementResource.java` ファイルを作成します:

source: Create the `src/main/java/org/acme/redis/IncrementService.java` file, with the following content:
ja_jp: 以下の内容の `src/main/java/org/acme/redis/IncrementService.java` ファイルを作成します:

source: Create the `src/main/java/org/acme/rest/client/ExtensionsResource.java` file with the following content:
ja_jp: `src/main/java/org/acme/rest/client/ExtensionsResource.java` ファイルを以下の内容で作成してください:

source: Create the `src/main/java/org/acme/rest/client/multipart/MultipartClientResource.java` file with the following content:
ja_jp: `src/main/java/org/acme/rest/client/multipart/MultipartClientResource.java` のファイルを、以下の内容で作成します。

source: Create the `src/main/java/org/acme/security/oauth2/TokenSecuredResource.java` file with the following content:
ja_jp: 以下の内容で `src/main/java/org/acme/security/oauth2/TokenSecuredResource.java` ファイルを作成します。

source: Create the `src/main/java/org/acme/services/BlueService.java` with the following content:
ja_jp: 以下の内容で `src/main/java/org/acme/services/BlueService.java` を作成してください。

source: Create the `src/main/java/org/acme/services/Registration.java` file with the following content:
ja_jp: `src/main/java/org/acme/services/Registration.java` ファイルを以下の内容で作成します。

source: Create the `src/main/java/org/acme/spring/di/GreeterResource.java` file with the following content:
ja_jp: `src/main/java/org/acme/spring/di/GreeterResource.java` のファイルを以下の内容で作成します:

source: Create the `src/main/java/org/acme/spring/web/GreetingController.java` file, a controller with the Spring Web annotations to define our REST endpoint, as follows:
ja_jp: RESTエンドポイントを定義するためのSpring Webアノテーションを持つコントローラである `src/main/java/org/acme/spring/web/GreetingController.java` ファイルを以下のように作成します:

source: Create the `src/main/resources/META-INF/resources/prices.html` file, with the following content:
ja_jp: 以下の内容の `src/main/resources/META-INF/resources/prices.html` ファイルを作成します :

source: Create the `src/main/resources/application.properties` file:
ja_jp: `src/main/resources/application.properties` ファイルを作成します。

source: Create the `src/test/java/org/acme/TheBestPlaceToBeResourceTest.java` class with the following content:
ja_jp: 以下の内容で `src/test/java/org/acme/TheBestPlaceToBeResourceTest.java` クラスを作成します：

source: Create the `src/test/java/org/acme/infinispan/client/InfinispanGreetingResourceTest.java` file with the following content:
ja_jp: 以下の内容で `src/test/java/org/acme/infinispan/client/InfinispanGreetingResourceTest.java` ファイルを作成します:

source: Create the `src/test/java/org/acme/optaplanner/rest/TimeTableResourceTest.java` class:
ja_jp: `src/test/java/org/acme/optaplanner/rest/TimeTableResourceTest.java` クラスを作成します。

source: Create the `src/test/java/org/acme/optaplanner/solver/TimeTableConstraintProviderTest.java` class:
ja_jp: `src/test/java/org/acme/optaplanner/solutioner/TimeTableConstraintProviderTest.java` クラスを作成します。

source: Create the `src/test/java/org/acme/redis/IncrementResourceTest.java` file with the following content:
ja_jp: `src/test/java/org/acme/redis/IncrementResourceTest.java` ファイルを以下の内容で作成してください:

source: Create the application workspace and import it into your favorite IDE. Let's add a Jakarta REST endpoint that can only be accessed by authenticated users:
ja_jp: アプリケーションワークスペースを作成し、お気に入りの IDE にインポートします。 ここでは、認証されたユーザーのみアクセス可能な Jakarta REST エンドポイントを追加します。

source: Create the appropriate JSON structure and store it in a YAML file.
ja_jp: 適切なJSON構造を作成し、YAMLファイルに格納します。

source: Create the configuration
ja_jp: コンフィグレーションの作成

source: Create the directory `src/main/java/org/acme/rest/client/multipart/server` and include a `EchoService.java` file with the following content:
ja_jp: `src/main/java/org/acme/rest/client/multipart/server` ディレクトリを作成し、以下の内容の `EchoService.java` ファイルを入れます。

source: Create the extension binding in the extension metadata (https://github.com/quarkusio/quarkus/blob/main/extensions/config-yaml/runtime/src/main/resources/META-INF/quarkus-extension.yaml#L12-L17[example, window="_blank"]). *Thanks to this, the codestart is added when the user selects the extension*
ja_jp: エクステンションのメタデータにエクステンションバインディングを作成します link:https://github.com/quarkusio/quarkus/blob/main/extensions/config-yaml/runtime/src/main/resources/META-INF/quarkus-extension.yaml#L12-L17[（例）, window=_blank]。 *これにより、ユーザーがエクステンションを選択したときにコードスタートが追加されます*

source: Create the following REST resource as `org.acme.validation.BookResource`:
ja_jp: 以下のRESTリソースを `org.acme.validation.BookResource` として作成します。

source: Create the following file in `$HOME/pipelines/ecs.conf`:
ja_jp: `$HOME/pipelines/ecs.conf` に次のファイルを作成します。

source: Create the following file in `$HOME/pipelines/gelf.conf`:
ja_jp: `$HOME/pipelines/gelf.conf` に以下のファイルを作成します。

source: Create the function
ja_jp: 関数を作成する

source: Create the interface
ja_jp: インターフェースの作成

source: Create the legacy project by executing the following command:
ja_jp: 次のコマンドを実行してレガシープロジェクトを作成します。

source: Create the record using `Record.of(k, v)`
ja_jp: `Record.of(k, v)` を使用してレコードを作成します

source: Create the solver service
ja_jp: ソルバーサービスの作成

source: Create the template contents (`hello.html`),
ja_jp: テンプレートコンテンツを作成する ( `hello.html` )

source: Create the transaction log table during the initial setup by setting the `create-table` property to `true`.
ja_jp: `create-table` プロパティを `true` に設定して、初期セットアップ中にトランザクション・ログ・テーブルを作成します。

source: Create the weather client
ja_jp: 天気クライアントの作成

source: Create xref:building-my-first-extension.adoc[a new extension] for your favorite web framework.
ja_jp: お気に入りの Web フレームワーク用の xref:building-my-first-extension.adoc[新しいエクステンション] を作成します。

source: Create your Alexa handler, as normal, by sub-classing the abstract `com.amazon.ask.SkillStreamHandler`, and add your request handler implementation.
ja_jp: 通常通り、抽象クラス `com.amazon.ask.SkillStreamHandler` をサブクラス化して Alexa ハンドラーを作成し、リクエストハンドラーの実装を追加します。

source: Create your health check following the xref:smallrye-health.adoc[SmallRye Health] guide. We advise providing only readiness check for an extension (liveness check is designed to express the fact that an application is up and needs to be lightweight).
ja_jp: xref:smallrye-health.adoc[SmallRye Health] ガイドに従ってヘルスチェックを作成します。エクステンションの readiness チェックのみを提供することをお勧めします (liveness チェックは、アプリケーションが稼働中で軽量である必要があるというファクトを示すために設計されています)。

source: Create your own metrics
ja_jp: 独自のメトリクスの作成

source: Created on
ja_jp: 作成日

source: Creates a `.env` configuration file in the root directory of your application and configures it to use the self-signed domain certificate and private key until you obtain the Let's Encrypt certificate.
ja_jp: アプリケーションの root ディレクトリーに `.env` 設定ファイルを作成し、Let's Encrypt 証明書を取得するまで、自己署名ドメイン証明書と秘密鍵を使用するように設定します。

source: Creates a `.env` configuration file in your application's root directory and configures the application to use the self-signed domain certificate and private key (until we get the Let's Encrypt certificate)
ja_jp: アプリケーションの root ディレクトリーに `.env` 設定ファイルを作成し、自己署名ドメイン証明書と秘密鍵を (Let's Encrypt 証明書を取得するまで) 使用するようにアプリケーションを設定します。

source: Creates a `.letsencrypt` folder in your application's root directory
ja_jp: アプリケーションの root ディレクトリーに `.letsencrypt` フォルダーを作成します。

source: Creates a `.letsencrypt` folder in your application's root directory.
ja_jp: アプリケーションの root ディレクトリーに `.letsencrypt` フォルダーを作成します。

source: Creates a `policies` alias for the `/policies.jar` classpath resource. The policies archive can also be located on the file system.
ja_jp: `/policies.jar` クラスパスリソースの `policies` エイリアスを作成します。 ポリシーアーカイブはファイルシステム上に配置することもできます。

source: Creates a base container image.
ja_jp: ベースコンテナーイメージを作成します。

source: Creates a code block (containing marked up code). This could also be made editable. This component uses the above mentioned code block from qomponent, that is built with https://codemirror.net/[code-mirror], but adds the automatic theme state when switching themes.
ja_jp: コードブロック (マークアップされたコードを含む) を作成します。これは編集可能にすることもできます。このコンポーネントは、上記の qomponent のコードブロックを使用しており、それは https://codemirror.net/[code-mirror] で構築されていますが、テーマを切り替える際に自動的なテーマ状態を追加します。

source: Creates a link to a resource (like a Java source file) that can be opened in the user's IDE (if we could detect the IDE).
ja_jp: ユーザーの IDE (IDE を検出できる場合) で開くことができるリソース (Java ソースファイルなど) へのリンクを作成します。

source: Creates a self-signed domain certificate and private key for your application configured in the previous <<lets-encrypt-prerequisites,Let's Encrypt prerequisites>> step to be able to start and accept HTTPS requests
ja_jp: HTTPS リクエストを開始して受け入れるためには、前の<<lets-encrypt-prerequisites,Let's Encrypt prerequisites>> ステップで設定したアプリケーション用の自己署名ドメイン証明書と秘密鍵を作成します。

source: Creates a self-signed domain certificate and private key for your application configured in the previous <<lets-encrypt-prerequisites,Let's Encrypt prerequisites>> step to start and accept HTTPS requests.
ja_jp: HTTPS リクエストを開始して受け入れるために、前の <<lets-encrypt-prerequisites,Let's Encrypt prerequisites>> ステップで設定したアプリケーション用の自己署名ドメイン証明書と秘密鍵を作成します。

source: Creates an instance of the interception proxy for the given instance of `MyClass`. The method calls will be forwarded to this target instance after all interceptors run.
ja_jp: 指定された `MyClass` インスタンスのインターセプトプロキシーのインスタンスを作成します。 すべてのインターセプターが実行された後、メソッド呼び出しはこのターゲットインスタンスに転送されます。

source: Creates and records Let's Encrypt account information.
ja_jp: Let's Encrypt アカウント情報を作成し、記録します。

source: Creates four new Maven modules:
ja_jp: 4 つの新しい Maven モジュールを作成します。

source: Creates the CSRF prevention configuration builder provided by the `quarkus-rest-csrf` extension. If this extension is missing, call to the `CSRF.builder()` will fail.
ja_jp: `quarkus-rest-csrf` エクステンションが提供する CSRF 防止設定ビルダーを作成します。このエクステンションが見つからない場合、`CSRF.builder()` の呼び出しは失敗します。

source: Creates the `HashCommands` object. This object has three type parameters: the type of the key, the type of the field, and the type of the member
ja_jp: `HashCommands` オブジェクトを作成します。このオブジェクトには 3 つのタイプ (キーのタイプ、フィールドのタイプ、メンバーのタイプ) のパラメーターがあります。

source: Creating Clients Programmatically
ja_jp: プログラムによるクライアントの作成

source: Creating JSON REST services with Quarkus is easy as it relies on proven and well known technologies.
ja_jp: Quarkusを使用したJSON RESTサービスの作成は、実績のあるよく知られたテクノロジーに依存しているため、簡単に行えます。

source: Creating JSON REST services with Quarkus is easy as it relies on proven and well-known technologies.
ja_jp: Quarkus を使用した JSON REST サービスの作成は、実績のあるよく知られたテクノロジーに依存しているため、簡単に行えます。

source: Creating Mail objects
ja_jp: メールオブジェクトの作成

source: Creating Quartz Tables
ja_jp: Quartz テーブルの作成

source: Creating Queries by fields
ja_jp: フィールド別のクエリの作成

source: Creating STM objects
ja_jp: STM オブジェクトの作成

source: Creating Your First Application
ja_jp: 初めてのアプリケーションの作成

source: Creating `@QuarkusTest` meta-annotation
ja_jp: `@QuarkusTest` メタアノテーションの作成

source: Creating a Blank Maven Project
ja_jp: 空白の Maven プロジェクトの作成

source: Creating a Dev Service
ja_jp: Dev Service の作成

source: Creating a Frontend
ja_jp: フロントエンドの作成

source: Creating a Greeting Message
ja_jp: 挨拶のメッセージを作成

source: Creating a JAX-RS endpoint
ja_jp: JAX-RS エンドポイントの作成

source: Creating a Jakarta REST endpoint
ja_jp: Jakarta RESTのエンドポイントの作成

source: Creating a Linux executable without GraalVM installed
ja_jp: GraalVM をインストールせずに Linux 実行可能ファイルを作成する方法

source: Creating a Maven project
ja_jp: Mavenプロジェクトの作成

source: Creating a Native Image Bundle
ja_jp: ネイティブイメージバンドルの作成

source: Creating a Non-CDI Service
ja_jp: 非CDIサービスの作成

source: Creating a Panache Entity
ja_jp: Panache エンティティーの作成

source: Creating a Quarkus extension for AWS CloudWatch
ja_jp: AWS CloudWatch用のQuarkusエクステンションの作成

source: Creating a REST resource and a test
ja_jp: RESTリソースとテストの作成

source: Creating a Reactive Frontend
ja_jp: リアクティブなフロントエンドの作成

source: Creating a Service & JSON REST Endpoint
ja_jp: サービスと JSONREST エンドポイントの作成

source: Creating a `ValidatorFactory` by yourself it not supported in native executables and if you try to do so, you will get an error similar to `jakarta.validation.NoProviderFoundException: Unable to create a Configuration, because no Jakarta Bean Validation provider could be found. Add a provider like Hibernate Validator (RI) to your classpath.` when running your native executable.
ja_jp: `ValidatorFactory` を自分で作成することは、ネイティブ実行可能ファイルではサポートされていません。作成しようとすると、ネイティブ実行可能ファイルを実行する際に `jakarta.validation.NoProviderFoundException: Unable to create a Configuration, because no Jakarta Bean Validation provider could be found. Add a provider like Hibernate Validator (RI) to your classpath.` のようなエラーが発生します。

source: Creating a container
ja_jp: コンテナーの作成

source: Creating a custom `SpanExporter` bean:
ja_jp: カスタム `SpanExporter` Bean の作成:

source: Creating a customized MeterRegistry
ja_jp: カスタマイズされたMeterRegistryの作成

source: Creating a frontend
ja_jp: フロントエンドの作成

source: Creating a native executable using build time certificates essentially means that the root certificates are fixed at image build time, based on the certificate configuration used at build time (which for Quarkus means when you perform a build having `quarkus.native.enabled=true` set). This avoids shipping a `cacerts` file or requiring a system property be set in order to set up root certificates that are provided by the OS where the binary runs.
ja_jp: ビルド時証明書を使用してネイティブ実行可能ファイルを作成するということは、基本的に、ビルド時（Quarkusの場合は、 `quarkus.native.enabled=true` を設定してビルドを実行した時）に使用される証明書設定に基づいて、イメージのビルド時にルート証明書が固定されるということです。これにより、バイナリを実行するOSが提供するルート証明書を設定するために、 `cacerts` ファイルを出荷したり、システムプロパティを設定する必要がなくなります。

source: Creating a native executable using build time certificates essentially means that the root certificates are fixed at image build time, based on the certificate configuration used at build time (which for Quarkus means when you perform a build having `quarkus.package.type=native` set). This avoids shipping a `cacerts` file or requiring a system property be set in order to set up root certificates that are provided by the OS where the binary runs.
ja_jp: ビルド時の証明書を使用してネイティブ実行可能ファイルを作成することは、基本的に、ビルド時（Quarkusでは、 `quarkus.package.type=native` が設定されているビルドの実行時を意味します）に使用される証明書構成に基づいて、イメージのビルド時にルート証明書が固定されることを意味します。これにより、バイナリを実行するOSによって提供されるルート証明書を設定するために、 `cacerts` ファイルを出荷したり、システムプロパティを設定する必要がなくなります。

source: Creating a new increment
ja_jp: 新しいインクリメントの作成

source: Creating a new project
ja_jp: 新規プロジェクトの作成

source: Creating a platform thread in Java takes time. Currently, techniques such as pooling where threads are created once then reused are strongly encouraged to minimize the time lost in starting them (as well as limiting the maximum number of threads to keep memory consumption low). Virtual threads are supposed to be disposable entities that we create when we need them, it is discouraged to pool them or to reuse them for different tasks.
ja_jp: Javaでプラットフォームスレッドを作成するのは時間がかかります。現時点ではスレッドの起動にかかる時間を最小限にするために、一度作成したスレッドを再利用するプーリングなどの技術を使うことが強く推奨されています（同様にメモリ消費を抑えるためにスレッドの最大数を制限することも推奨されています）。仮想スレッドは必要なときに作る使い捨ての存在であり、スレッドをプールしたり異なるタスクに再利用したりすることは推奨されません。

source: Creating a platform thread in Java takes time. Currently, techniques such as pooling, where threads are created once and then reused, are strongly encouraged to minimize the time lost in starting them (as well as limiting the maximum number of threads to keep memory consumption low). Virtual threads are supposed to be disposable entities that we create when we need them, it is discouraged to pool them or reuse them for different tasks.
ja_jp: Java でプラットフォームスレッドを作成するには時間がかかります。 現在では、スレッドを一度作成してから再利用するプーリングのようなテクニックが、スレッドの起動にかかる時間のロスを最小限に抑えるために強く推奨されています (同様に、メモリー消費量を低く抑えるためにスレッドの最大数を制限することも推奨されています）。 仮想スレッドは必要なときに作成する使い捨てのものであり、 スレッドをプールしたり別のタスクに再利用したりすることは推奨されません。

source: Creating a release
ja_jp: リリースの作成

source: Creating a scheduled job
ja_jp: スケジュールされたジョブの作成

source: Creating a service & JSON REST endpoint
ja_jp: serviceとJSON RESTエンドポイントの作成

source: Creating a tutorial
ja_jp: チュートリアルの作成

source: Creating an App
ja_jp: アプリの作成

source: Creating an agent requires producing an `AgentCard` and an `AgentExecutor`. The `@PublicAgentCard` qualifier marks the public agent card that serves as the entry point for discovery - this is what clients retrieve when discovering your agent. You can also provide an extended agent card with additional authenticated information. Here's a minimal example:
ja_jp: エージェントの作成には、`AgentCard` と `AgentExecutor` の生成が必要です。`@PublicAgentCard` 修飾子は、検出のエントリポイントとして機能する公開エージェントカードをマークします。これは、クライアントがエージェントを検出する際に取得するものです。また、追加の認証情報を含む拡張エージェントカードを提供することもできます。以下に最小限の例を示します。

source: Creating an application-scoped bean that implements one of these interfaces and annotating it with `@PersistenceUnitExtension` (or `@PersistenceUnitExtension("nameOfYourPU")` for a <<multiple-persistence-units,named persistence unit>>) will automatically register it with the corresponding persistence unit.
ja_jp: これらのインターフェースのいずれかを実装したアプリケーションスコープの Bean を作成し、 `@PersistenceUnitExtension` (名前付き永続化ユニットの場合は `@PersistenceUnitExtension("nameOfYourPU")` ) アノテーションを付与すると、対応する永続化ユニットに自動的に登録されます。

source: Creating caches from the client
ja_jp: クライアントからキャッシュを作成

source: Creating configuration programmatically
ja_jp: プログラムによる設定の作成

source: Creating new Maven project
ja_jp: 新しい Maven プロジェクトの作成

source: Creating new extensions may appear to be an intricate task at first but once you understood the Quarkus game-changer paradigm (build time vs runtime) the structure of an extension makes perfectly sense.
ja_jp: 新しいエクステンションの作成は、最初は複雑な作業に見えるかもしれませんが、Quarkus の変革をもたらすパラダイム (ビルド時間とランタイム) を理解してしまえば、エクステンションの構造は完璧に理にかなったものになります。

source: Creating new extensions may appear to be an intricate task at first, but once you understand the Quarkus game-changer paradigm (build time vs runtime) the structure of an extension makes perfectly sense.
ja_jp: 新しいエクステンションの作成は、最初は複雑な作業に見えるかもしれませんが、Quarkus の画期的なパラダイム (ビルド時とランタイム) を理解すれば、エクステンションの構造は完全に理にかなったものになります。

source: Creating pull requests for doc updates
ja_jp: ドキュメント更新のためのプルリクエストの作成

source: Creating separate, named configurations by using `+quarkus.tls.<name>.*+`. By specifying the `+quarkus.tls.<name>.*+` properties, you can adapt the TLS settings for a specific component.
ja_jp: `+quarkus.tls.<name>.*+` を使用して、個別の名前付き設定を作成します。 `+quarkus.tls.<name>.*+` プロパティーを使用すると、特定のコンポーネントの TLS 設定を受け入れることができます。

source: Creating the Aggregator Maven Project
ja_jp: アグリゲータMavenプロジェクトの作成

source: Creating the Data Model and Data Access Objects
ja_jp: データモデルとデータアクセスオブジェクトの作成

source: Creating the Greeting POJO
ja_jp: Greeting POJOを作成

source: Creating the Greeting Schema
ja_jp: Greeting スキーマを作成

source: Creating the Increment POJO
ja_jp: インクリメントPOJOの作成

source: Creating the Increment Resource
ja_jp: インクリメントリソースの作成

source: Creating the Increment Service
ja_jp: インクリメントサービスの作成

source: Creating the Infinispan Greeting Resource
ja_jp: InfinispanのGreetingリソースを作成

source: Creating the Maven Deployment Project
ja_jp: Maven デプロイメントプロジェクトの作成

source: Creating the Maven Project
ja_jp: Mavenプロジェクトの作成

source: Creating the Maven project
ja_jp: Mavenプロジェクトの作成

source: Creating the Maven/Gradle Project
ja_jp: Maven/Gradleプロジェクトの作成

source: Creating the Producer Maven Project
ja_jp: Producer Maven プロジェクトの作成

source: Creating the Project
ja_jp: プロジェクトの作成

source: Creating the REST API
ja_jp: REST APIの作成

source: Creating the REST resource
ja_jp: RESTリソースの作成

source: Creating the Task Entity
ja_jp: タスクエンティティの作成
